# -----------------------------------------------------------------------------
# FROMコマンド
# -----------------------------------------------------------------------------
# どのimageを元にimageを作成するかの指定
# イメージ名:タグ名の形式
FROM ubuntu:20.04


# -----------------------------------------------------------------------------
# RUNコマンド
# -----------------------------------------------------------------------------
# パッケージ等のインストールコマンド
# ここに記述したコマンドを実行してimageのレイヤーを重ねる

# まずはパッケージの更新するよ
RUN apt-get update

# サーバーエンジンのインストール
RUN apt-get install -y nginx=1.18.0-0ubuntu1.3

# DB
RUN apt-get install -y mysql-server=8.0.29-0ubuntu0.20.04.3

# PHP
RUN apt-get install -y php=2:7.4+75

# PHPUnit
RUN apt-get install -y phpunit=8.5.2-1ubuntu1


# -----------------------------------------------------------------------------
# CMD コマンド指定
# -----------------------------------------------------------------------------
# コンテナが作成された後で実行するコマンドを指定する

EXPOSE 80
CMD ["/usr/sbin/nginx", "-g", "daemon off;"]